Public Attributes | List of all members
API_GhostRecord Struct Reference
View Handling
Describes a tracing (ghost) database. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_Coord  | offset
Position of the reference database.
double  | rotation
Rotation angle of the reference database.
double  | scale
Scale factor of the reference database.
GSTime  | time
Last modification time of the reference database.
API_DatabaseUnId  | parentDatabase
Identifier of the parent database (i.e. out of which the reference database was created from).
API_DatabaseUnId  | ghostDatabase
Own identifier.
API_DatabaseTypeID  | ghostDBType
Type of the reference database.
API_ShowGhostType  | ghostType
Reference previous/above current/below current story.
API_ElemFilter  | filter
Tells which element types are visible.
short  | floor
Original floor of the reference database.
bool  | activated
Is it activated?
bool  | show
Is it shown?
API_RGBAColor  | ghostColor
Reference database color with transparency.
bool  | ghostOriginalColor
The color of the ghost view.
bool  | ghostOriginalTone
The tone of the ghost view.
bool  | ghostBackgroundFill
The background fill of the ghost view.
API_RGBAColor  | viewColor
Parent database color with transparency.
bool  | viewOriginalColor
The color of the originating view.
bool  | viewOriginalTone
The tone of the originating view.
bool  | viewBackgroundFill
The background fill of the originating view.
bool  | ghostOnTop
Is Ghost on the top?
Detailed Description
Describes a tracing (ghost) database.
Remarks
This structure describes the Trace feature related information.
Member Data Documentation
◆ activated
 API_GhostRecord::activated
Is it activated?
◆ filter
 API_GhostRecord::filter
Tells which element types are visible.
◆ floor
 API_GhostRecord::floor
Original floor of the reference database.
◆ ghostBackgroundFill
 API_GhostRecord::ghostBackgroundFill
The background fill of the ghost view.
◆ ghostColor
 API_GhostRecord::ghostColor
Reference database color with transparency.
◆ ghostDatabase
 API_GhostRecord::ghostDatabase
Own identifier.
◆ ghostDBType
 API_GhostRecord::ghostDBType
Type of the reference database.
◆ ghostOnTop
 API_GhostRecord::ghostOnTop
Is Ghost on the top?
◆ ghostOriginalColor
 API_GhostRecord::ghostOriginalColor
The color of the ghost view.
◆ ghostOriginalTone
 API_GhostRecord::ghostOriginalTone
The tone of the ghost view.
◆ ghostType
 API_GhostRecord::ghostType
Reference previous/above current/below current story.
◆ offset
 API_GhostRecord::offset
Position of the reference database.
◆ parentDatabase
 API_GhostRecord::parentDatabase
Identifier of the parent database (i.e. out of which the reference database was created from).
◆ rotation
 API_GhostRecord::rotation
Rotation angle of the reference database.
◆ scale
 API_GhostRecord::scale
Scale factor of the reference database.
◆ show
 API_GhostRecord::show
Is it shown?
◆ time
 API_GhostRecord::time
Last modification time of the reference database.
◆ viewBackgroundFill
 API_GhostRecord::viewBackgroundFill
The background fill of the originating view.
◆ viewColor
 API_GhostRecord::viewColor
Parent database color with transparency.
◆ viewOriginalColor
 API_GhostRecord::viewOriginalColor
The color of the originating view.
◆ viewOriginalTone
 API_GhostRecord::viewOriginalTone
The tone of the originating view.